#include <iostream>
using namespace std;

//Template List
// Функция лист будет состоять из template class и вложенного класса node
// нужно реализовать след функции:
// 1. Удаление верхнего элемента
// 2. Добавление нового элемента в конец списка
// 3. Получение размера списка
// 4. Перегрузка оператора [] для получения доступа по индексу к  элементам списка
// 5. Функция добавления в начало списка элемента
// 6. Функция вставки элемента по индексу
// 7. Функция удаления элемента по индексу
// 8. Функция удаления элемента в конце спика
//

int main()
{

	return 0;
}